import numpy as np


def test():
    # --------------------------- 加减乘除运算 --------------------------
    x = np.arange(9).reshape((3, 3))
    y = np.arange(10, 13)

    print(x + y)
    print(x * y)
    print(x / y)
    print(x - y)
    '''
    [[10 12 14]
    [13 15 17]
    [16 18 20]]
    
    [[ 0 11 24]
    [30 44 60]
    [60 77 96]]
    
    [[0.         0.09090909 0.16666667]
    [0.3        0.36363636 0.41666667]
    [0.6        0.63636364 0.66666667]]

    [[-10 -10 -10]
    [ -7  -7  -7]
    [ -4  -4  -4]]

    '''

    # ------------------ around() 、floor() 、ceil() -------------
    a = np.array([1.0, 4.55, 123, 0.567, 25.532])
    print(np.round(a))
    print(np.floor(a))  # 向下取整
    print(np.ceil(a))  # 向上取整
    '''
    [  1.   5. 123.   1.  26.]
    [  1.   4. 123.   0.  25.]
    [  1.   5. 123.   1.  26.]
    '''

    # ------------------------ 聚合函数 ---------------------------
    '''
np.sum() 求和
np.prod() 所有元素相乘
np.mean() 平均值
np.std() 标准差
np.var() 方差
np.median() 中数
np.power() 幂运算
np.sqrt() 开方
np.min() 最小值
np.max() 最大值
np.argmin() 最小值的下标
np.argmax() 最大值的下标
np.inf 无穷大
np.exp(10) 以 e 为底的指数
np.log(10) 对数
    '''


if __name__ == '__main__':
    test()
